create_clock -period 5.000 -name clk -waveform {0.000 2.500} [get_ports clk]
#set_input_delay -clock [get_clocks clk] -min -add_delay 2.000 [get_ports {in_ai[*]}]
#set_input_delay -clock [get_clocks clk] -max -add_delay 8.000 [get_ports {in_ai[*]}]
#set_input_delay -clock [get_clocks clk] -min -add_delay 2.000 [get_ports {in_ar[*]}]
#set_input_delay -clock [get_clocks clk] -max -add_delay 8.000 [get_ports {in_ar[*]}]
#set_input_delay -clock [get_clocks clk] -min -add_delay 2.000 [get_ports {in_bi[*]}]
#set_input_delay -clock [get_clocks clk] -max -add_delay 8.000 [get_ports {in_bi[*]}]
#set_input_delay -clock [get_clocks clk] -min -add_delay 2.000 [get_ports {in_br[*]}]
#set_input_delay -clock [get_clocks clk] -max -add_delay 8.000 [get_ports {in_br[*]}]
#set_input_delay -clock [get_clocks clk] -min -add_delay 2.000 [get_ports clken]
#set_input_delay -clock [get_clocks clk] -max -add_delay 8.000 [get_ports clken]
#set_input_delay -clock [get_clocks clk] -min -add_delay 2.000 [get_ports in_val]
#set_input_delay -clock [get_clocks clk] -max -add_delay 8.000 [get_ports in_val]
#set_input_delay -clock [get_clocks clk] -min -add_delay 2.000 [get_ports rst]
#set_input_delay -clock [get_clocks clk] -max -add_delay 8.000 [get_ports rst]
#set_output_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports {out_pi[*]}]
#set_output_delay -clock [get_clocks clk] -max -add_delay 8.000 [get_ports {out_pi[*]}]
#set_output_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports {out_pr[*]}]
#set_output_delay -clock [get_clocks clk] -max -add_delay 8.000 [get_ports {out_pr[*]}]
#set_output_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports out_val]
#set_output_delay -clock [get_clocks clk] -max -add_delay 8.000 [get_ports out_val]
